zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph5/PERI_DCM_GPR.h
/*
** ###################################################################
**     Processors:          MCXE315MLF
**                          MCXE315MPA
**                          MCXE316MLF
**                          MCXE316MPA
**
**     Version:             rev. 1.0, 2025-07-18
**     Build:               b260716
**
**     Abstract:
**         CMSIS Peripheral Access Layer for DCM_GPR
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2024-11-19)
**         Initial version.
**     - rev. 1.0 (2025-07-18)
**         Rev2 RM.
**
** ###################################################################
*/

/*!
 * @file PERI_DCM_GPR.h
 * @version 1.0
 * @date 2025-07-18
 * @brief CMSIS Peripheral Access Layer for DCM_GPR
 *
 * CMSIS Peripheral Access Layer for DCM_GPR
 */

#if !defined(PERI_DCM_GPR_H_)
#define PERI_DCM_GPR_H_                          /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE315MLF) || defined(CPU_MCXE315MPA))
#include "MCXE315_COMMON.h"
#elif (defined(CPU_MCXE316MLF) || defined(CPU_MCXE316MPA))
#include "MCXE316_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- DCM_GPR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCM_GPR_Peripheral_Access_Layer DCM_GPR Peripheral Access Layer
 * @{
 */

/** DCM_GPR - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[512];
  __IO uint32_t DCMROD1;                           /**< Read-Only GPR On Destructive Reset 1, offset: 0x200 */
       uint8_t RESERVED_1[4];
  __IO uint32_t DCMROD3;                           /**< Read-Only GPR On Destructive Reset 3, offset: 0x208 */
  __IO uint32_t DCMROD4;                           /**< Read-Only GPR On Destructive Reset 4, offset: 0x20C */
  __IO uint32_t DCMROD5;                           /**< Read-Only GPR On Destructive Reset 5, offset: 0x210 */
       uint8_t RESERVED_2[236];
  __I  uint32_t DCMROF1;                           /**< Read-Only GPR On Functional Reset 1, offset: 0x300 */
  __IO uint32_t DCMROF2;                           /**< Read-Only GPR On Functional Reset 2, offset: 0x304 */
  __IO uint32_t DCMROF3;                           /**< Read-Only GPR On Functional Reset 3, offset: 0x308 */
  __IO uint32_t DCMROF4;                           /**< Read-Only GPR On Functional Reset 4, offset: 0x30C */
  __IO uint32_t DCMROF5;                           /**< Read-Only GPR On Functional Reset 5, offset: 0x310 */
  __IO uint32_t DCMROF6;                           /**< Read-Only GPR On Functional Reset 6, offset: 0x314 */
  __IO uint32_t DCMROF7;                           /**< Read-Only GPR On Functional Reset 7, offset: 0x318 */
  __IO uint32_t DCMROF8;                           /**< Read-Only GPR On Functional Reset 8, offset: 0x31C */
  __IO uint32_t DCMROF9;                           /**< Read-Only GPR On Functional Reset 9, offset: 0x320 */
  __IO uint32_t DCMROF10;                          /**< Read-Only GPR On Functional Reset 10, offset: 0x324 */
  __IO uint32_t DCMROF11;                          /**< Read-Only GPR On Functional Reset 11, offset: 0x328 */
  __IO uint32_t DCMROF12;                          /**< Read-Only GPR On Functional Reset 12, offset: 0x32C */
  __IO uint32_t DCMROF13;                          /**< Read-Only GPR On Functional Reset 13, offset: 0x330 */
  __IO uint32_t DCMROF14;                          /**< Read-Only GPR On Functional Reset 14, offset: 0x334 */
  __IO uint32_t DCMROF15;                          /**< Read-Only GPR On Functional Reset 15, offset: 0x338 */
  __IO uint32_t DCMROF16;                          /**< Read-Only GPR On Functional Reset 16, offset: 0x33C */
  __IO uint32_t DCMROF17;                          /**< Read-Only GPR On Functional Reset 17, offset: 0x340 */
       uint8_t RESERVED_3[4];
  __I  uint32_t DCMROF19;                          /**< Read-Only GPR On Functional Reset 19, offset: 0x348 */
  __I  uint32_t DCMROF20;                          /**< Read-Only GPR On Functional Reset 20, offset: 0x34C */
  __I  uint32_t DCMROF21;                          /**< Read-Only GPR On Functional Reset 21, offset: 0x350 */
       uint8_t RESERVED_4[172];
  __IO uint32_t DCMRWP1;                           /**< Read Write GPR On POR 1, offset: 0x400 */
       uint8_t RESERVED_5[4];
  __IO uint32_t DCMRWP3;                           /**< Read Write GPR On POR 3, offset: 0x408 */
       uint8_t RESERVED_6[248];
  __IO uint32_t DCMRWD2;                           /**< Read Write GPR On Destructive Reset 2, offset: 0x504 */
  __IO uint32_t DCMRWD3;                           /**< Read Write GPR On Destructive Reset 3, offset: 0x508 */
  __IO uint32_t DCMRWD4;                           /**< Read Write GPR On Destructive Reset 4, offset: 0x50C */
  __IO uint32_t DCMRWD5;                           /**< Read Write GPR On Destructive Reset 5, offset: 0x510 */
  __IO uint32_t DCMRWD6;                           /**< Read Write GPR On Destructive Reset 6, offset: 0x514 */
  __I  uint32_t DCMRWD7;                           /**< Read Write GPR On Destructive Reset 7, offset: 0x518 */
  __I  uint32_t DCMRWD8;                           /**< Read Write GPR On Destructive Reset 8, offset: 0x51C */
  __I  uint32_t DCMRWD9;                           /**< Read Write GPR On Destructive Reset 9, offset: 0x520 */
       uint8_t RESERVED_7[220];
  __IO uint32_t DCMRWF1;                           /**< Read Write GPR On Functional Reset 1, offset: 0x600 */
  __IO uint32_t DCMRWF2;                           /**< Read Write GPR On Functional Reset 2, offset: 0x604 */
       uint8_t RESERVED_8[4];
  __IO uint32_t DCMRWF4;                           /**< Read Write GPR On Functional Reset 4, offset: 0x60C */
  __IO uint32_t DCMRWF5;                           /**< Read Write GPR On Functional Reset 5, offset: 0x610 */
       uint8_t RESERVED_9[236];
  __IO uint32_t DCMROPP1;                          /**< Read-Only GPR On PMCPOR Reset 1, offset: 0x700 */
  __IO uint32_t DCMROPP2;                          /**< Read-Only GPR On PMCPOR Reset 2, offset: 0x704 */
  __IO uint32_t DCMROPP3;                          /**< Read-Only GPR On PMCPOR Reset 3, offset: 0x708 */
  __IO uint32_t DCMROPP4;                          /**< Read-Only GPR On PMCPOR Reset 4, offset: 0x70C */
} DCM_GPR_Type;

/* ----------------------------------------------------------------------------
   -- DCM_GPR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCM_GPR_Register_Masks DCM_GPR Register Masks
 * @{
 */

/*! @name DCMROD1 - Read-Only GPR On Destructive Reset 1 */
/*! @{ */

#define DCM_GPR_DCMROD1_PCU_ISO_STATUS_MASK      (0x1U)
#define DCM_GPR_DCMROD1_PCU_ISO_STATUS_SHIFT     (0U)
/*! PCU_ISO_STATUS - PCU Input Isolation Status On Previous Standby Entry
 *  0b0..No
 *  0b1..Yes
 */
#define DCM_GPR_DCMROD1_PCU_ISO_STATUS(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD1_PCU_ISO_STATUS_SHIFT)) & DCM_GPR_DCMROD1_PCU_ISO_STATUS_MASK)
/*! @} */

