zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph5/PERI_DCM_GPR.h
#define DCM_GPR_DCMROF20_POR_WDG_EN_MASK         (0x1U)
#define DCM_GPR_DCMROF20_POR_WDG_EN_SHIFT        (0U)
/*! POR_WDG_EN - POR Watchdog (POR_WDG) Status
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define DCM_GPR_DCMROF20_POR_WDG_EN(x)           (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF20_POR_WDG_EN_SHIFT)) & DCM_GPR_DCMROF20_POR_WDG_EN_MASK)

#define DCM_GPR_DCMROF20_AIPS_IAHB_BYP_MASK      (0x40U)
#define DCM_GPR_DCMROF20_AIPS_IAHB_BYP_SHIFT     (6U)
/*! AIPS_IAHB_BYP
 *  0b0..Register wall enabled.
 *  0b1..Register wall bypassed.
 */
#define DCM_GPR_DCMROF20_AIPS_IAHB_BYP(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF20_AIPS_IAHB_BYP_SHIFT)) & DCM_GPR_DCMROF20_AIPS_IAHB_BYP_MASK)

#define DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_MASK   (0xFFFC0000U)
#define DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_SHIFT  (18U)
/*! DCF_DEST_RST_ESC - DCF Destructive Reset Escalation
 *  0b00000000000000..Disables
 *  0b00000000000001..Enables
 */
#define DCM_GPR_DCMROF20_DCF_DEST_RST_ESC(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_SHIFT)) & DCM_GPR_DCMROF20_DCF_DEST_RST_ESC_MASK)
/*! @} */

/*! @name DCMROF21 - Read-Only GPR On Functional Reset 21 */
/*! @{ */

#define DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_MASK   (0x3FFFFU)
#define DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_SHIFT  (0U)
/*! DCF_DEST_RST_ESC - DCF Destructive Reset Escalation
 *  0b000000000000000000..Disables
 *  0b000000000000000001..Enables
 */
#define DCM_GPR_DCMROF21_DCF_DEST_RST_ESC(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_SHIFT)) & DCM_GPR_DCMROF21_DCF_DEST_RST_ESC_MASK)

#define DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_MASK (0x180000U)
#define DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_SHIFT (19U)
/*! HSE_CLK_MODE_OPTION - HSE_B Clock Mode Option
 *  0b00..Option A
 *  0b01..Options C, D, E, E2, and F
 *  0b10..Option B
 *  0b11..Option B
 */
#define DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_SHIFT)) & DCM_GPR_DCMROF21_HSE_CLK_MODE_OPTION_MASK)
/*! @} */

/*! @name DCMRWP1 - Read Write GPR On POR 1 */
/*! @{ */

#define DCM_GPR_DCMRWP1_CLKOUT_STANDBY_MASK      (0x8U)
#define DCM_GPR_DCMRWP1_CLKOUT_STANDBY_SHIFT     (3U)
/*! CLKOUT_STANDBY - Clockout Standby Expose Over Functional And Destructive Reset
 *  0b0..No
 *  0b1..Yes
 */
#define DCM_GPR_DCMRWP1_CLKOUT_STANDBY(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWP1_CLKOUT_STANDBY_SHIFT)) & DCM_GPR_DCMRWP1_CLKOUT_STANDBY_MASK)

#define DCM_GPR_DCMRWP1_STANBDY_PWDOG_DIS_MASK   (0x100U)
#define DCM_GPR_DCMRWP1_STANBDY_PWDOG_DIS_SHIFT  (8U)
/*! STANBDY_PWDOG_DIS - Standby POR_WDG Disable
 *  0b0..Enables
 *  0b1..Disables
 */
#define DCM_GPR_DCMRWP1_STANBDY_PWDOG_DIS(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWP1_STANBDY_PWDOG_DIS_SHIFT)) & DCM_GPR_DCMRWP1_STANBDY_PWDOG_DIS_MASK)

#define DCM_GPR_DCMRWP1_POR_WDOG_TRIM_MASK       (0x600U)
#define DCM_GPR_DCMRWP1_POR_WDOG_TRIM_SHIFT      (9U)
/*! POR_WDOG_TRIM - POR_WDG Trim
 *  0b00..POR_WDG timeout = 06.25 ms
 *  0b01..POR_WDG timeout = 12.50 ms
 *  0b10..POR_WDG timeout = 25.00 ms
 *  0b11..POR_WDG timeout = 50.00 ms
 */
#define DCM_GPR_DCMRWP1_POR_WDOG_TRIM(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWP1_POR_WDOG_TRIM_SHIFT)) & DCM_GPR_DCMRWP1_POR_WDOG_TRIM_MASK)

#define DCM_GPR_DCMRWP1_DEST_RESET_COUNT_MASK    (0x7800U)
#define DCM_GPR_DCMRWP1_DEST_RESET_COUNT_SHIFT   (11U)
/*! DEST_RESET_COUNT - Destructive Reset Counts */
#define DCM_GPR_DCMRWP1_DEST_RESET_COUNT(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWP1_DEST_RESET_COUNT_SHIFT)) & DCM_GPR_DCMRWP1_DEST_RESET_COUNT_MASK)

#define DCM_GPR_DCMRWP1_SYS_REC_COUNTER_MASK     (0x1F0000U)
#define DCM_GPR_DCMRWP1_SYS_REC_COUNTER_SHIFT    (16U)
/*! SYS_REC_COUNTER - System Recovery Counter */
#define DCM_GPR_DCMRWP1_SYS_REC_COUNTER(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWP1_SYS_REC_COUNTER_SHIFT)) & DCM_GPR_DCMRWP1_SYS_REC_COUNTER_MASK)

#define DCM_GPR_DCMRWP1_SBAF_REC_DIS_FRST_MASK   (0x400000U)
#define DCM_GPR_DCMRWP1_SBAF_REC_DIS_FRST_SHIFT  (22U)
/*! SBAF_REC_DIS_FRST - Disable Recovery Mode On Functional Reset */
#define DCM_GPR_DCMRWP1_SBAF_REC_DIS_FRST(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWP1_SBAF_REC_DIS_FRST_SHIFT)) & DCM_GPR_DCMRWP1_SBAF_REC_DIS_FRST_MASK)

#define DCM_GPR_DCMRWP1_SBAF_REC_DIS_DRST_MASK   (0x800000U)
#define DCM_GPR_DCMRWP1_SBAF_REC_DIS_DRST_SHIFT  (23U)
/*! SBAF_REC_DIS_DRST - Disable Recovery Mode On Destructive Reset */
#define DCM_GPR_DCMRWP1_SBAF_REC_DIS_DRST(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWP1_SBAF_REC_DIS_DRST_SHIFT)) & DCM_GPR_DCMRWP1_SBAF_REC_DIS_DRST_MASK)
/*! @} */

/*! @name DCMRWP3 - Read Write GPR On POR 3 */
/*! @{ */

#define DCM_GPR_DCMRWP3_DEST_RST9_AS_IPI_MASK    (0x200U)
#define DCM_GPR_DCMRWP3_DEST_RST9_AS_IPI_SHIFT   (9U)
/*! DEST_RST9_AS_IPI - Destructive Reset 9
 *  0b0..Destructive reset
 *  0b1..PLL LOL interrupt
 */
#define DCM_GPR_DCMRWP3_DEST_RST9_AS_IPI(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWP3_DEST_RST9_AS_IPI_SHIFT)) & DCM_GPR_DCMRWP3_DEST_RST9_AS_IPI_MASK)
/*! @} */

/*! @name DCMRWD2 - Read Write GPR On Destructive Reset 2 */
/*! @{ */

#define DCM_GPR_DCMRWD2_EOUT_STAT_DUR_STEST_MASK (0x80U)
#define DCM_GPR_DCMRWD2_EOUT_STAT_DUR_STEST_SHIFT (7U)
/*! EOUT_STAT_DUR_STEST - Controls the EOUT state during self-test
 *  0b0..High impedance
 *  0b1..Fault state
 */
#define DCM_GPR_DCMRWD2_EOUT_STAT_DUR_STEST(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD2_EOUT_STAT_DUR_STEST_SHIFT)) & DCM_GPR_DCMRWD2_EOUT_STAT_DUR_STEST_MASK)
/*! @} */

/*! @name DCMRWD3 - Read Write GPR On Destructive Reset 3 */
/*! @{ */

#define DCM_GPR_DCMRWD3_CM7_0_LOCKUP_EN_MASK     (0x1U)
#define DCM_GPR_DCMRWD3_CM7_0_LOCKUP_EN_SHIFT    (0U)
/*! CM7_0_LOCKUP_EN - Cortex-M7 Lockup Enable
 *  0b0..No
 *  0b1..Yes
 */
#define DCM_GPR_DCMRWD3_CM7_0_LOCKUP_EN(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD3_CM7_0_LOCKUP_EN_SHIFT)) & DCM_GPR_DCMRWD3_CM7_0_LOCKUP_EN_MASK)

#define DCM_GPR_DCMRWD3_TCM_GSKT_ALARM_EN_MASK   (0x20U)
#define DCM_GPR_DCMRWD3_TCM_GSKT_ALARM_EN_SHIFT  (5U)
/*! TCM_GSKT_ALARM_EN - TCM Gasket Alarm Enable
 *  0b0..No
 *  0b1..Yes
 */
#define DCM_GPR_DCMRWD3_TCM_GSKT_ALARM_EN(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD3_TCM_GSKT_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD3_TCM_GSKT_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD3_SYS_AXBS_ALARM_EN_MASK   (0x100U)
#define DCM_GPR_DCMRWD3_SYS_AXBS_ALARM_EN_SHIFT  (8U)
/*! SYS_AXBS_ALARM_EN - System AXBS Alarm Enable
 *  0b0..No
 *  0b1..Yes
 */
#define DCM_GPR_DCMRWD3_SYS_AXBS_ALARM_EN(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD3_SYS_AXBS_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD3_SYS_AXBS_ALARM_EN_MASK)

#define DCM_GPR_DCMRWD3_HSE_GSKT_ALARM_EN_MASK   (0x800U)
#define DCM_GPR_DCMRWD3_HSE_GSKT_ALARM_EN_SHIFT  (11U)
/*! HSE_GSKT_ALARM_EN - HSE_B Gasket Alarm Enable
 *  0b0..No
 *  0b1..Yes
 */
#define DCM_GPR_DCMRWD3_HSE_GSKT_ALARM_EN(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD3_HSE_GSKT_ALARM_EN_SHIFT)) & DCM_GPR_DCMRWD3_HSE_GSKT_ALARM_EN_MASK)

