zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph5/PERI_DCM_GPR.h
/*! @name DCMRWF1 - Read Write GPR On Functional Reset 1 */
/*! @{ */

#define DCM_GPR_DCMRWF1_FCCU_SW_NCF0_MASK        (0x4U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF0_SHIFT       (2U)
/*! FCCU_SW_NCF0 - FCCU Software NCF 0
 *  0b0..Not generated
 *  0b1..Generated
 */
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF0(x)          (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_FCCU_SW_NCF0_SHIFT)) & DCM_GPR_DCMRWF1_FCCU_SW_NCF0_MASK)

#define DCM_GPR_DCMRWF1_FCCU_SW_NCF1_MASK        (0x8U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF1_SHIFT       (3U)
/*! FCCU_SW_NCF1 - FCCU Software NCF 1
 *  0b0..Not generated
 *  0b1..Generated
 */
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF1(x)          (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_FCCU_SW_NCF1_SHIFT)) & DCM_GPR_DCMRWF1_FCCU_SW_NCF1_MASK)

#define DCM_GPR_DCMRWF1_FCCU_SW_NCF2_MASK        (0x10U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF2_SHIFT       (4U)
/*! FCCU_SW_NCF2 - FCCU Software NCF 2
 *  0b0..Not generated
 *  0b1..Generated
 */
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF2(x)          (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_FCCU_SW_NCF2_SHIFT)) & DCM_GPR_DCMRWF1_FCCU_SW_NCF2_MASK)

#define DCM_GPR_DCMRWF1_FCCU_SW_NCF3_MASK        (0x20U)
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF3_SHIFT       (5U)
/*! FCCU_SW_NCF3 - FCCU Software NCF 3
 *  0b0..Not generated
 *  0b1..Generated
 */
#define DCM_GPR_DCMRWF1_FCCU_SW_NCF3(x)          (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_FCCU_SW_NCF3_SHIFT)) & DCM_GPR_DCMRWF1_FCCU_SW_NCF3_MASK)

#define DCM_GPR_DCMRWF1_STANDBY_IO_CONFIG_MASK   (0x10000U)
#define DCM_GPR_DCMRWF1_STANDBY_IO_CONFIG_SHIFT  (16U)
/*! STANDBY_IO_CONFIG - Standby I/O Configuration
 *  0b0..Must be written as 0 before IO configurations are done in standby entry sequence.
 *  0b1..Must be written as 1 after IO configurations are done on standby exit.
 */
#define DCM_GPR_DCMRWF1_STANDBY_IO_CONFIG(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_STANDBY_IO_CONFIG_SHIFT)) & DCM_GPR_DCMRWF1_STANDBY_IO_CONFIG_MASK)

#define DCM_GPR_DCMRWF1_SUPPLY_MON_EN_MASK       (0x100000U)
#define DCM_GPR_DCMRWF1_SUPPLY_MON_EN_SHIFT      (20U)
/*! SUPPLY_MON_EN - Supply Monitoring Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define DCM_GPR_DCMRWF1_SUPPLY_MON_EN(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_SUPPLY_MON_EN_SHIFT)) & DCM_GPR_DCMRWF1_SUPPLY_MON_EN_MASK)

#define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_MASK      (0xE00000U)
#define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT     (21U)
/*! SUPPLY_MON_SEL - Supply Monitoring Select
 *  0b000..VDD_HV_A_DIV
 *  0b001..VDD_HV_B_DIV
 *  0b010..VDD_1.5_DIV
 *  0b011..VDD_2.5_OSC
 *  0b100..VDD1.1_PD1_HOT_POINT
 *  0b101..VDD1.1_PD1_COLD_POINT
 *  0b110..VDD1.1_PLL
 *  0b111..VDD1.1_PD0
 */
#define DCM_GPR_DCMRWF1_SUPPLY_MON_SEL(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_SHIFT)) & DCM_GPR_DCMRWF1_SUPPLY_MON_SEL_MASK)

#define DCM_GPR_DCMRWF1_VSS_LV_ANMUX_EN_MASK     (0x1000000U)
#define DCM_GPR_DCMRWF1_VSS_LV_ANMUX_EN_SHIFT    (24U)
/*! VSS_LV_ANMUX_EN - VSS_LV Monitoring Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define DCM_GPR_DCMRWF1_VSS_LV_ANMUX_EN(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_VSS_LV_ANMUX_EN_SHIFT)) & DCM_GPR_DCMRWF1_VSS_LV_ANMUX_EN_MASK)

#define DCM_GPR_DCMRWF1_VDD_HV_A_VLT_DVDR_EN_MASK (0x2000000U)
#define DCM_GPR_DCMRWF1_VDD_HV_A_VLT_DVDR_EN_SHIFT (25U)
/*! VDD_HV_A_VLT_DVDR_EN - VDD_HV_A Voltage Divider Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define DCM_GPR_DCMRWF1_VDD_HV_A_VLT_DVDR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF1_VDD_HV_A_VLT_DVDR_EN_SHIFT)) & DCM_GPR_DCMRWF1_VDD_HV_A_VLT_DVDR_EN_MASK)
/*! @} */

/*! @name DCMRWF2 - Read Write GPR On Functional Reset 2 */
/*! @{ */

#define DCM_GPR_DCMRWF2_DCM_SCAN_BYP_STDBY_EXT_MASK (0x8U)
#define DCM_GPR_DCMRWF2_DCM_SCAN_BYP_STDBY_EXT_SHIFT (3U)
/*! DCM_SCAN_BYP_STDBY_EXT - DCM Scan Bypass Standby Exit
 *  0b0..Not bypassed
 *  0b1..Bypassed
 */
#define DCM_GPR_DCMRWF2_DCM_SCAN_BYP_STDBY_EXT(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_DCM_SCAN_BYP_STDBY_EXT_SHIFT)) & DCM_GPR_DCMRWF2_DCM_SCAN_BYP_STDBY_EXT_MASK)

#define DCM_GPR_DCMRWF2_FIRC_TRIM_BYP_STDBY_EXT_MASK (0x10U)
#define DCM_GPR_DCMRWF2_FIRC_TRIM_BYP_STDBY_EXT_SHIFT (4U)
/*! FIRC_TRIM_BYP_STDBY_EXT - FIRC Trim Bypass Standby Exit
 *  0b0..Not bypassed
 *  0b1..Bypassed
 */
#define DCM_GPR_DCMRWF2_FIRC_TRIM_BYP_STDBY_EXT(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_FIRC_TRIM_BYP_STDBY_EXT_SHIFT)) & DCM_GPR_DCMRWF2_FIRC_TRIM_BYP_STDBY_EXT_MASK)

#define DCM_GPR_DCMRWF2_PMC_TRIM_RGM_DCF_BYP_STDBY_EXT_MASK (0x20U)
#define DCM_GPR_DCMRWF2_PMC_TRIM_RGM_DCF_BYP_STDBY_EXT_SHIFT (5U)
/*! PMC_TRIM_RGM_DCF_BYP_STDBY_EXT - PMC Trim MC_RGM DCF Bypass Standby Exit
 *  0b0..Not bypassed
 *  0b1..Bypassed
 */
#define DCM_GPR_DCMRWF2_PMC_TRIM_RGM_DCF_BYP_STDBY_EXT(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_PMC_TRIM_RGM_DCF_BYP_STDBY_EXT_SHIFT)) & DCM_GPR_DCMRWF2_PMC_TRIM_RGM_DCF_BYP_STDBY_EXT_MASK)

#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_MASK     (0x10000U)
#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_SHIFT    (16U)
/*! HSE_GSKT_BYPASS - HSE_B Gasket Bypass
 *  0b0..Not bypassed
 *  0b1..Bypassed
 */
#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_SHIFT)) & DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_MASK)
/*! @} */

/*! @name DCMRWF4 - Read Write GPR On Functional Reset 4 */
/*! @{ */

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S18_MASK (0x1U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S18_SHIFT (0U)
/*! MUX_MODE_EN_ADC1_S18 - Controls the selection of GPIOs to drive ADC1 standard channel 18th.
 *  0b0..Selects GPIO_70 as the ADC1_S18.
 *  0b1..Selects GPIO_6 as the ADC1_S18.
 */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S18(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S18_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S18_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8_MASK (0x2U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8_SHIFT (1U)
/*! MUX_MODE_EN_ADC0_S8 - Mux Mode Enable ADC_0 Standard Channel 8
 *  0b0..GPIO_0
 *  0b1..GPIO_45
 */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9_MASK (0x4U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9_SHIFT (2U)
/*! MUX_MODE_EN_ADC0_S9 - Mux Mode Enable ADC_0 Standard Channel 9
 *  0b0..GPIO_1
 *  0b1..GPIO_46
 */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14_MASK (0x8U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14_SHIFT (3U)
/*! MUX_MODE_EN_ADC1_S14 - Mux Mode Enable ADC_1 Standard Channel 14
 *  0b0..GPIO_69
 *  0b1..GPIO_32
 */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15_MASK (0x10U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15_SHIFT (4U)
/*! MUX_MODE_EN_ADC1_S15 - Mux Mode Enable ADC_1 Standard Channel 15
 *  0b0..GPIO_4
 *  0b1..GPIO_33
 */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S12_MASK (0x80U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S12_SHIFT (7U)
/*! MUX_MODE_EN_ADC0_S12 - Mux Mode Enable ADC_0 Standard Channel 12
 *  0b0..GPIO_72
 *  0b1..GPIO_78
 */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S12(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S12_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S12_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S13_MASK (0x100U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S13_SHIFT (8U)
/*! MUX_MODE_EN_ADC0_S13 - Mux Mode Enable ADC_0 Standard Channel 13
 *  0b0..GPIO_73
 *  0b1..GPIO_79
 */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S13(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S13_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S13_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S14_MASK (0x800U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S14_SHIFT (11U)
/*! MUX_MODE_EN_ADC0_S14 - Mux Mode Enable ADC_0 Standard Channel 14
 *  0b0..GPIO_32
 *  0b1..GPIO_80
 */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S14(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S14_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S14_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S17_MASK (0x1000U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S17_SHIFT (12U)
/*! MUX_MODE_EN_ADC0_S17 - Mux Mode Enable ADC_0 Standard Channel 17
 *  0b0..GPIO_75
 *  0b1..GPIO_44
 */
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S17(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S17_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S17_MASK)

#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP_MASK (0x2000U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP_SHIFT (13U)
/*! GLITCH_FIL_TRG_IN0_BYP - Glitch Filter TRGMUX Input 0 Bypass
 *  0b0..Enables
 *  0b1..Bypasses
 */
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP_SHIFT)) & DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP_MASK)

#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP_MASK (0x4000U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP_SHIFT (14U)
/*! GLITCH_FIL_TRG_IN1_BYP - Glitch Filter TRGMUX Input 1 Bypass
 *  0b0..Enables
 *  0b1..Bypasses
 */
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP_SHIFT)) & DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP_MASK)

